ADMINS = [
	"752594294",
]

MSGS = {
	"start": "Привет! Выбери, чье расписание тебя интересует",
	"student_group": "Выберите группу, расписание которой хотите увидеть",
	"student_day": "Выберите день недели",
	"student_week": "Выберите чет/нечет неделю",
	"student_timetable": "<b>Расписание на:</b> <em>{0} ({1})</em>\n<b>Для группы:</b> <em>{2}</em>\n\n{3}",

	"teacher_name": "Выберите ФИО преподавателя, расписание которого вы хотите получить",
	"teacher_day": "Выберите день недели",
	"teacher_week": "Выберите чет/нечет неделю",
	"teacher_timetable": "<b>Расписание на:</b> <em>{0}({1})</em>\n<b>Преподаватель:</b> <em>{2}</em>\n\n{3}",

	"teacher_info__start": "Выберите фамилию преподавателя, про которого хотите узнать информацию"
}

BUTTONS = {
	"start": {
		"students": "Студентов 👨‍🎓",
		"teachers": "Преподавателей 👨‍🏫",
		"teacher_info": "Про преподавателей ❓",
	},
	"groups": [
		"4131", "4132", "4133", "4134",
		"4135", "4136", "4137", "4138",
		"4140", "4141", "4142", "4143",
	],
	"days": ["пн", "вт", "ср", "чт", "пт", "сб"],
	"weeks": {
		"even": "Чётная",
		"odd": "Нечётная"
	},
}

TEACHERS = [
	{ "name": "Швецова", "desc": "Самый добрый преподаватель на свете, предмет свой любит, приветствуются дискуссии во время пары, весьма снисходительно относится к студентам, но проявлять к ней неуважение - первородный грех.", "chance": "70%"},

	{ "name": "Туманова", "desc": "Строга, но справедлива. Если хоть немного учишься - вопросов не будет никаких. Если забиваешь - получать будешь каждую пару.", "chance": "40%"},

	{ "name": "Сиразеева", "desc": "Очень любит свой предмет и тех, кто активничает на ее парах. Слегка язвительно относится к тем, кто нарушает дисциплину. Может минут 5-10 подряд говорить на отвлеченную тему, если ее о чем-нибудь спросить.", "chance": "90%"},

	{ "name": "Муртазина", "desc": "Строгая, учащихся студентов не трогает и уважает, забивающих на предмет презирает и с лёгкостью отправляет на допку.", "chance": "30%"},

	{ "name": "Иринархова", "desc": "Очень хорошо объясняет предмет, работает с теми, кто занимается, лояльно относится ко всем. Если группа отстаёт, может принять радикальные меры: доп. срезы в начале пары и т.п.", "chance": "50%"},

	{ "name": "Салимова", "desc": "Добрая женщина, предмет даёт, всех и каждого хочет подтянуть, заботливая, но требовательная.", "chance": "80%"},

	{ "name": "Курунова", "desc": "Строгий, но добрый препод. Всегда пойдет навстречу, если что-то непонятно. К тем, кто не пытается учиться, жалости не испытывает.", "chance": "40%" },

	{ "name": "Нигматзянова", "desc": "Немного беглый, строгий препод с характером. Если хорошо учишься - молодец, но за косяки будешь получать, как все. ", "chance": "50%"},

	{ "name": "Семагина", "desc": "Преподаватель довольно лояльный, приятно общаться с ней на парах, не цапает за пропуски и опоздания. шутит по поводу домашки:", "chance": "0%"},

	{ "name": "Кривилев", "desc": "к опозданиям и пропускам на пофиг , домашки почти нету, строг в оценивании, списать невозможно почти что, а если получится, то со временем поймет стратегию и присечё", "chance": "5%"},
]