ADMINS = [
	"752594294",
]

MSGS = {
	"start": "Привет! Выбери, чье расписание тебя интересует",
	"student_group": "Выберите группу, расписание которой хотите увидеть",
	"student_day": "Выберите день недели",
	"student_week": "Выберите чет/нечет неделю",
	"student_timetable": "<b>Расписание на:</b> <em>{0} ({1})</em>\n<b>Для группы:</b> <em>{2}</em>\n\n{3}"
}

BUTTONS = {
	"start": {
		"students": "Студентов 👨‍🎓",
		"teachers": "Преподавателей 👨‍🏫",
	},
	"groups": [
		"4131", "4132", "4133", "4134",
		"4135", "4136", "4137", "4138",
		"4140", "4141", "4142", "4143",
	],
	"days": ["пн", "вт", "ср", "чт", "пт", "сб"],
	"weeks": {
		"even": "Чётная",
		"odd": "Нечётная"
	},
}